---
name: "golang的错误处理"
createdat: 2019-06-05
tags:
    - golang
    - 错误处理
---

# golang的错误处理

最近用golang写了个[小项目](https://github.com/duckbill-io/duckbill), 发现用golang写项目就必须对错误处有一定的了解, 所以对golang的错误处理做了简单的整理

## 基本观念

发生错误只是许多预料之内的行为而已. 
错误处理应该可以帮助迅速准确的定位错误, 错误处理时要根据情况与错误的上下文,选择不同的处理方式;
任何错误处理的技巧都是建立在上面几条基本观念之上的.

## 错误处理策略

golang中的错误一般用error处理而不是异常(panic)处理,是为了避免错误最终以难以理解的栈跟踪信息报告给用户.

### 子程序

- 直接忽略错误
- 错误只存在一种情况,则使用bool型
- 使用官方的error类型
- 使用自定义的error类型

### 主程序

- 记录错误并对出,例如使用log.Fatal
- 记录错误

## 简化错误处理的技巧

- check风格
- defer加匿名函数

## 异常与异常捕获

### 异常

异常往往是为了处理对于bug等不可预料的错误, 或使用error不好处理的错误

### 异常捕获

- 一般在使用第三方包时要使用recover 来捕获第三方包发送的异常,转换为错误进行输出
- 提供api供他人使用的时候,内部即使用了panic,对外的api也要使用recover,对外返回error
